sysbench/zlib/log/oltp_read_only.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 14351.47 qps: 229639.92 (r/w/o: 200935.38/0.00/28704.54) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 14865.92 qps: 237848.79 (r/w/o: 208117.05/0.00/29731.74) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 14860.14 qps: 237766.57 (r/w/o: 208046.18/0.00/29720.38) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 14925.49 qps: 238804.33 (r/w/o: 208953.35/0.00/29850.98) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 14972.80 qps: 239570.17 (r/w/o: 209624.56/0.00/29945.61) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 14674.91 qps: 234794.54 (r/w/o: 205444.72/0.00/29349.82) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 14889.99 qps: 238238.29 (r/w/o: 208458.40/0.00/29779.89) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 14883.80 qps: 238143.28 (r/w/o: 208375.57/0.00/29767.71) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 14930.58 qps: 238889.93 (r/w/o: 209028.86/0.00/29861.07) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 14884.89 qps: 238157.94 (r/w/o: 208388.06/0.00/29769.88) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 14905.88 qps: 238495.25 (r/w/o: 208683.59/0.00/29811.67) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 14900.17 qps: 238399.87 (r/w/o: 208599.53/0.00/29800.33) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 14741.90 qps: 235872.54 (r/w/o: 206388.65/0.00/29483.89) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 14649.90 qps: 234399.59 (r/w/o: 205099.79/0.00/29299.80) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 14725.65 qps: 235605.37 (r/w/o: 206154.17/0.00/29451.20) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 14925.55 qps: 238809.38 (r/w/o: 208958.17/0.00/29851.21) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 14948.84 qps: 239183.03 (r/w/o: 209285.55/0.00/29897.48) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 14803.88 qps: 236865.12 (r/w/o: 207257.17/0.00/29607.95) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 14952.15 qps: 239234.35 (r/w/o: 209330.05/0.00/29904.31) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 14864.61 qps: 237834.49 (r/w/o: 208105.27/0.00/29729.22) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 14765.75 qps: 236247.74 (r/w/o: 206716.23/0.00/29531.50) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 14818.30 qps: 237095.23 (r/w/o: 207458.63/0.00/29636.60) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 14928.63 qps: 238858.32 (r/w/o: 209001.27/0.00/29857.05) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 14855.54 qps: 237688.33 (r/w/o: 207977.05/0.00/29711.28) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 14795.82 qps: 236733.55 (r/w/o: 207141.91/0.00/29591.64) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 14731.10 qps: 235694.86 (r/w/o: 206232.77/0.00/29462.10) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 14847.65 qps: 237562.88 (r/w/o: 207867.58/0.00/29695.30) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 14802.53 qps: 236842.68 (r/w/o: 207237.52/0.00/29605.16) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 14874.30 qps: 237986.17 (r/w/o: 208237.47/0.00/29748.70) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 14786.15 qps: 236578.80 (r/w/o: 207006.70/0.00/29572.10) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 16 tps: 14864.94 qps: 237840.81 (r/w/o: 208110.83/0.00/29729.98) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 16 tps: 14680.04 qps: 234881.61 (r/w/o: 205521.72/0.00/29359.89) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 16 tps: 14894.42 qps: 238308.82 (r/w/o: 208519.78/0.00/29789.04) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 16 tps: 14804.36 qps: 236868.23 (r/w/o: 207259.52/0.00/29608.72) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 16 tps: 14648.15 qps: 234375.03 (r/w/o: 205078.73/0.00/29296.30) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 16 tps: 14765.03 qps: 236237.62 (r/w/o: 206707.66/0.00/29529.97) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 16 tps: 14944.29 qps: 239109.37 (r/w/o: 209220.70/0.00/29888.67) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 16 tps: 14779.53 qps: 236474.76 (r/w/o: 206915.69/0.00/29559.07) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 16 tps: 14781.63 qps: 236505.16 (r/w/o: 206941.90/0.00/29563.26) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 16 tps: 14886.98 qps: 238191.15 (r/w/o: 208417.20/0.00/29773.96) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 16 tps: 14887.03 qps: 238190.48 (r/w/o: 208416.42/0.00/29774.06) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 16 tps: 14900.79 qps: 238410.97 (r/w/o: 208609.39/0.00/29801.58) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 16 tps: 14989.13 qps: 239829.53 (r/w/o: 209851.27/0.00/29978.27) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 16 tps: 14937.50 qps: 238997.21 (r/w/o: 209122.31/0.00/29874.90) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 16 tps: 14896.96 qps: 238351.76 (r/w/o: 208557.84/0.00/29793.92) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 16 tps: 14999.40 qps: 239989.76 (r/w/o: 209991.05/0.00/29998.71) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 16 tps: 15001.64 qps: 240027.02 (r/w/o: 210023.64/0.00/30003.38) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 16 tps: 14958.08 qps: 239332.18 (r/w/o: 209415.92/0.00/29916.26) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 16 tps: 15038.25 qps: 240610.26 (r/w/o: 210533.85/0.00/30076.41) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 16 tps: 14940.02 qps: 239039.15 (r/w/o: 209159.10/0.00/29880.04) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 16 tps: 14955.17 qps: 239284.65 (r/w/o: 209374.22/0.00/29910.43) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 16 tps: 14755.02 qps: 236081.96 (r/w/o: 206571.92/0.00/29510.05) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 16 tps: 14743.60 qps: 235892.24 (r/w/o: 206405.04/0.00/29487.21) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 16 tps: 14855.96 qps: 237698.93 (r/w/o: 207987.10/0.00/29711.83) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 16 tps: 14815.64 qps: 237049.01 (r/w/o: 207417.64/0.00/29631.38) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 16 tps: 14619.53 qps: 233913.08 (r/w/o: 204674.22/0.00/29238.86) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 16 tps: 14755.10 qps: 236082.84 (r/w/o: 206572.54/0.00/29510.29) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 16 tps: 14930.93 qps: 238895.26 (r/w/o: 209033.31/0.00/29861.96) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 16 tps: 14855.95 qps: 237690.52 (r/w/o: 207978.63/0.00/29711.89) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 16 tps: 14862.08 qps: 237796.84 (r/w/o: 208072.68/0.00/29724.15) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 610s ] thds: 16 tps: 14702.72 qps: 235241.57 (r/w/o: 205836.32/0.00/29405.25) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 620s ] thds: 16 tps: 14954.32 qps: 239270.15 (r/w/o: 209361.32/0.00/29908.83) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 630s ] thds: 16 tps: 15025.76 qps: 240414.06 (r/w/o: 210362.64/0.00/30051.42) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 640s ] thds: 16 tps: 14826.13 qps: 237216.53 (r/w/o: 207564.28/0.00/29652.25) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 650s ] thds: 16 tps: 14617.64 qps: 233880.98 (r/w/o: 204645.59/0.00/29235.38) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 660s ] thds: 16 tps: 14732.40 qps: 235720.77 (r/w/o: 206255.96/0.00/29464.81) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 670s ] thds: 16 tps: 14867.58 qps: 237878.46 (r/w/o: 208143.50/0.00/29734.96) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 680s ] thds: 16 tps: 14909.86 qps: 238560.36 (r/w/o: 208740.44/0.00/29819.92) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 690s ] thds: 16 tps: 14905.23 qps: 238481.72 (r/w/o: 208671.25/0.00/29810.46) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 700s ] thds: 16 tps: 14890.85 qps: 238254.07 (r/w/o: 208472.36/0.00/29781.71) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 710s ] thds: 16 tps: 14986.23 qps: 239778.09 (r/w/o: 209805.73/0.00/29972.36) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 720s ] thds: 16 tps: 14876.37 qps: 238025.27 (r/w/o: 208272.43/0.00/29752.85) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 730s ] thds: 16 tps: 14843.05 qps: 237488.99 (r/w/o: 207802.89/0.00/29686.10) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 740s ] thds: 16 tps: 14609.90 qps: 233756.16 (r/w/o: 204536.36/0.00/29219.79) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 750s ] thds: 16 tps: 14642.41 qps: 234280.85 (r/w/o: 204996.03/0.00/29284.82) lat (ms,95%): 1.32 err/s: 0.00 reconn/s: 0.00
[ 760s ] thds: 16 tps: 14797.69 qps: 236762.19 (r/w/o: 207166.80/0.00/29595.39) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 770s ] thds: 16 tps: 14914.34 qps: 238629.39 (r/w/o: 208800.80/0.00/29828.59) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 780s ] thds: 16 tps: 14831.55 qps: 237304.28 (r/w/o: 207641.08/0.00/29663.20) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 790s ] thds: 16 tps: 14853.96 qps: 237666.23 (r/w/o: 207958.32/0.00/29707.92) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 800s ] thds: 16 tps: 14929.59 qps: 238872.42 (r/w/o: 209013.24/0.00/29859.18) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 810s ] thds: 16 tps: 14919.41 qps: 238707.84 (r/w/o: 208869.01/0.00/29838.83) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 820s ] thds: 16 tps: 14917.85 qps: 238685.18 (r/w/o: 208849.47/0.00/29835.71) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 830s ] thds: 16 tps: 14870.67 qps: 237935.50 (r/w/o: 208194.15/0.00/29741.35) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 840s ] thds: 16 tps: 14946.01 qps: 239133.62 (r/w/o: 209241.69/0.00/29891.93) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 850s ] thds: 16 tps: 14889.23 qps: 238227.89 (r/w/o: 208449.33/0.00/29778.56) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 860s ] thds: 16 tps: 14718.03 qps: 235489.64 (r/w/o: 206053.57/0.00/29436.07) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 870s ] thds: 16 tps: 14941.58 qps: 239066.50 (r/w/o: 209183.33/0.00/29883.16) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 880s ] thds: 16 tps: 14874.94 qps: 237996.89 (r/w/o: 208247.01/0.00/29749.89) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 890s ] thds: 16 tps: 14868.76 qps: 237895.21 (r/w/o: 208157.79/0.00/29737.41) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 900s ] thds: 16 tps: 14986.05 qps: 239781.18 (r/w/o: 209809.18/0.00/29972.00) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 910s ] thds: 16 tps: 14842.17 qps: 237477.20 (r/w/o: 207792.66/0.00/29684.54) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 920s ] thds: 16 tps: 14922.83 qps: 238761.24 (r/w/o: 208915.77/0.00/29845.47) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 930s ] thds: 16 tps: 14829.00 qps: 237262.14 (r/w/o: 207603.94/0.00/29658.21) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 940s ] thds: 16 tps: 14897.00 qps: 238355.88 (r/w/o: 208561.87/0.00/29794.01) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 950s ] thds: 16 tps: 14985.81 qps: 239771.49 (r/w/o: 209799.87/0.00/29971.62) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 960s ] thds: 16 tps: 14952.71 qps: 239247.74 (r/w/o: 209342.41/0.00/29905.33) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 970s ] thds: 16 tps: 14806.56 qps: 236897.92 (r/w/o: 207284.80/0.00/29613.11) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 980s ] thds: 16 tps: 14888.47 qps: 238219.43 (r/w/o: 208442.39/0.00/29777.04) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 990s ] thds: 16 tps: 15051.30 qps: 240822.65 (r/w/o: 210720.04/0.00/30102.61) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1000s ] thds: 16 tps: 15144.58 qps: 242310.62 (r/w/o: 212021.46/0.00/30289.17) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1010s ] thds: 16 tps: 15028.88 qps: 240460.69 (r/w/o: 210402.93/0.00/30057.76) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1020s ] thds: 16 tps: 14690.25 qps: 235046.17 (r/w/o: 205665.66/0.00/29380.51) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1030s ] thds: 16 tps: 14791.19 qps: 236660.64 (r/w/o: 207078.26/0.00/29582.38) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1040s ] thds: 16 tps: 14752.32 qps: 236035.18 (r/w/o: 206530.54/0.00/29504.65) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1050s ] thds: 16 tps: 14943.61 qps: 239098.89 (r/w/o: 209211.68/0.00/29887.21) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1060s ] thds: 16 tps: 14879.33 qps: 238066.00 (r/w/o: 208307.33/0.00/29758.66) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1070s ] thds: 16 tps: 15106.98 qps: 241714.05 (r/w/o: 211500.09/0.00/30213.96) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1080s ] thds: 16 tps: 15136.72 qps: 242189.06 (r/w/o: 211915.63/0.00/30273.43) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1090s ] thds: 16 tps: 14845.67 qps: 237527.99 (r/w/o: 207836.66/0.00/29691.34) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1100s ] thds: 16 tps: 14997.15 qps: 239953.96 (r/w/o: 209959.77/0.00/29994.20) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1110s ] thds: 16 tps: 14850.31 qps: 237606.69 (r/w/o: 207906.08/0.00/29700.61) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1120s ] thds: 16 tps: 14724.08 qps: 235585.73 (r/w/o: 206137.67/0.00/29448.07) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1130s ] thds: 16 tps: 14815.83 qps: 237051.17 (r/w/o: 207419.51/0.00/29631.66) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1140s ] thds: 16 tps: 14912.41 qps: 238599.48 (r/w/o: 208774.47/0.00/29825.01) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1150s ] thds: 16 tps: 14817.76 qps: 237085.74 (r/w/o: 207450.22/0.00/29635.52) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1160s ] thds: 16 tps: 14964.77 qps: 239435.06 (r/w/o: 209505.52/0.00/29929.53) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1170s ] thds: 16 tps: 14862.55 qps: 237803.20 (r/w/o: 208078.00/0.00/29725.20) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1180s ] thds: 16 tps: 14979.76 qps: 239673.23 (r/w/o: 209713.81/0.00/29959.42) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1190s ] thds: 16 tps: 15117.06 qps: 241873.40 (r/w/o: 211639.28/0.00/30234.13) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1200s ] thds: 16 tps: 14990.72 qps: 239854.44 (r/w/o: 209873.00/0.00/29981.44) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1210s ] thds: 16 tps: 15014.97 qps: 240234.69 (r/w/o: 210204.74/0.00/30029.95) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1220s ] thds: 16 tps: 14983.41 qps: 239735.31 (r/w/o: 209768.49/0.00/29966.81) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1230s ] thds: 16 tps: 14885.19 qps: 238165.08 (r/w/o: 208394.70/0.00/29770.39) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1240s ] thds: 16 tps: 14977.12 qps: 239628.34 (r/w/o: 209674.09/0.00/29954.24) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1250s ] thds: 16 tps: 14967.86 qps: 239489.13 (r/w/o: 209553.50/0.00/29935.63) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1260s ] thds: 16 tps: 14945.92 qps: 239137.61 (r/w/o: 209245.67/0.00/29891.94) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1270s ] thds: 16 tps: 15066.95 qps: 241067.12 (r/w/o: 210933.22/0.00/30133.90) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1280s ] thds: 16 tps: 14867.24 qps: 237881.35 (r/w/o: 208147.07/0.00/29734.28) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1290s ] thds: 16 tps: 14791.78 qps: 236664.14 (r/w/o: 207080.47/0.00/29583.67) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1300s ] thds: 16 tps: 14874.03 qps: 237986.74 (r/w/o: 208238.67/0.00/29748.07) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1310s ] thds: 16 tps: 14925.32 qps: 238807.06 (r/w/o: 208956.32/0.00/29850.73) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1320s ] thds: 16 tps: 14881.04 qps: 238093.79 (r/w/o: 208331.72/0.00/29762.07) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1330s ] thds: 16 tps: 14889.25 qps: 238228.09 (r/w/o: 208449.69/0.00/29778.40) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1340s ] thds: 16 tps: 14990.30 qps: 239846.33 (r/w/o: 209865.62/0.00/29980.70) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1350s ] thds: 16 tps: 15013.30 qps: 240213.46 (r/w/o: 210186.86/0.00/30026.61) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1360s ] thds: 16 tps: 14960.72 qps: 239372.06 (r/w/o: 209450.63/0.00/29921.43) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1370s ] thds: 16 tps: 14739.41 qps: 235824.82 (r/w/o: 206346.10/0.00/29478.71) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1380s ] thds: 16 tps: 14816.87 qps: 237071.79 (r/w/o: 207437.94/0.00/29633.85) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1390s ] thds: 16 tps: 14937.44 qps: 239000.80 (r/w/o: 209126.03/0.00/29874.78) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1400s ] thds: 16 tps: 14878.63 qps: 238056.22 (r/w/o: 208298.87/0.00/29757.35) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1410s ] thds: 16 tps: 14894.68 qps: 238317.54 (r/w/o: 208528.18/0.00/29789.35) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1420s ] thds: 16 tps: 14966.17 qps: 239458.26 (r/w/o: 209525.93/0.00/29932.33) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1430s ] thds: 16 tps: 14899.91 qps: 238395.34 (r/w/o: 208595.62/0.00/29799.72) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1440s ] thds: 16 tps: 14931.24 qps: 238901.07 (r/w/o: 209038.49/0.00/29862.58) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1450s ] thds: 16 tps: 14897.77 qps: 238365.66 (r/w/o: 208570.12/0.00/29795.55) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1460s ] thds: 16 tps: 14910.22 qps: 238564.55 (r/w/o: 208744.11/0.00/29820.44) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1470s ] thds: 16 tps: 14934.73 qps: 238955.36 (r/w/o: 209085.90/0.00/29869.46) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1480s ] thds: 16 tps: 14842.04 qps: 237475.41 (r/w/o: 207791.32/0.00/29684.09) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1490s ] thds: 16 tps: 14840.29 qps: 237440.20 (r/w/o: 207759.71/0.00/29680.49) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1500s ] thds: 16 tps: 14913.14 qps: 238611.38 (r/w/o: 208785.00/0.00/29826.39) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1510s ] thds: 16 tps: 14808.15 qps: 236929.92 (r/w/o: 207313.63/0.00/29616.29) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1520s ] thds: 16 tps: 14870.53 qps: 237928.75 (r/w/o: 208187.69/0.00/29741.06) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1530s ] thds: 16 tps: 14871.90 qps: 237951.63 (r/w/o: 208207.94/0.00/29743.69) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1540s ] thds: 16 tps: 14839.12 qps: 237427.85 (r/w/o: 207749.50/0.00/29678.34) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1550s ] thds: 16 tps: 14953.17 qps: 239246.05 (r/w/o: 209339.81/0.00/29906.24) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1560s ] thds: 16 tps: 14931.59 qps: 238907.66 (r/w/o: 209044.48/0.00/29863.18) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1570s ] thds: 16 tps: 14958.63 qps: 239338.10 (r/w/o: 209420.74/0.00/29917.36) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1580s ] thds: 16 tps: 14896.16 qps: 238340.18 (r/w/o: 208547.87/0.00/29792.31) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1590s ] thds: 16 tps: 14963.02 qps: 239406.50 (r/w/o: 209480.46/0.00/29926.04) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1600s ] thds: 16 tps: 14894.01 qps: 238302.59 (r/w/o: 208514.66/0.00/29787.92) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1610s ] thds: 16 tps: 14926.33 qps: 238822.86 (r/w/o: 208970.09/0.00/29852.77) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1620s ] thds: 16 tps: 14797.29 qps: 236755.96 (r/w/o: 207161.38/0.00/29594.58) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1630s ] thds: 16 tps: 14822.26 qps: 237154.38 (r/w/o: 207509.87/0.00/29644.51) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1640s ] thds: 16 tps: 14874.99 qps: 238002.99 (r/w/o: 208253.00/0.00/29749.99) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1650s ] thds: 16 tps: 14954.55 qps: 239274.62 (r/w/o: 209365.52/0.00/29909.10) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1660s ] thds: 16 tps: 14945.55 qps: 239127.03 (r/w/o: 209235.93/0.00/29891.10) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1670s ] thds: 16 tps: 14899.51 qps: 238391.72 (r/w/o: 208592.69/0.00/29799.03) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1680s ] thds: 16 tps: 14816.22 qps: 237059.79 (r/w/o: 207427.45/0.00/29632.34) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1690s ] thds: 16 tps: 14753.36 qps: 236053.20 (r/w/o: 206546.39/0.00/29506.81) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1700s ] thds: 16 tps: 14787.18 qps: 236593.37 (r/w/o: 207018.91/0.00/29574.46) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1710s ] thds: 16 tps: 14850.81 qps: 237613.50 (r/w/o: 207911.99/0.00/29701.51) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1720s ] thds: 16 tps: 14944.79 qps: 239117.74 (r/w/o: 209228.16/0.00/29889.58) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1730s ] thds: 16 tps: 14898.78 qps: 238379.59 (r/w/o: 208582.03/0.00/29797.56) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1740s ] thds: 16 tps: 14819.53 qps: 237112.20 (r/w/o: 207473.14/0.00/29639.06) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1750s ] thds: 16 tps: 14772.79 qps: 236366.06 (r/w/o: 206820.49/0.00/29545.57) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1760s ] thds: 16 tps: 14885.24 qps: 238162.19 (r/w/o: 208391.81/0.00/29770.37) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1770s ] thds: 16 tps: 14880.72 qps: 238089.70 (r/w/o: 208328.25/0.00/29761.45) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1780s ] thds: 16 tps: 14864.19 qps: 237828.52 (r/w/o: 208100.13/0.00/29728.39) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1790s ] thds: 16 tps: 14759.48 qps: 236151.14 (r/w/o: 206632.19/0.00/29518.96) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            374831366
        write:                           0
        other:                           53547338
        total:                           428378704
    transactions:                        26773669 (14874.22 per sec.)
    queries:                             428378704 (237987.59 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      14874.2244
    time elapsed:                        1800.0044s
    total number of events:              26773669

Latency (ms):
         min:                                    0.82
         avg:                                    1.07
         max:                                   43.69
         95th percentile:                        1.25
         sum:                             28753627.86

Threads fairness:
    events (avg/stddev):           1673354.3125/14508.23
    execution time (avg/stddev):   1797.1017/0.02